camellion0/pic32_ata_isp/src/system_config/default/framework/peripheral/can/processor/can_p32mz2048efm100.h
/* Created by plibgen $Revision: 1.31 $ */

#ifndef _CAN_P32MZ2048EFM100_H
#define _CAN_P32MZ2048EFM100_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

typedef enum {

    CAN_ID_1 = _CAN1_BASE_ADDRESS,
    CAN_ID_2 = _CAN2_BASE_ADDRESS,
    CAN_NUMBER_OF_MODULES = 2

} CAN_MODULE_ID;

typedef enum {

    CAN_CHANNEL0 = 0x00,
    CAN_CHANNEL1 = 0x01,
    CAN_CHANNEL2 = 0x02,
    CAN_CHANNEL3 = 0x03,
    CAN_CHANNEL4 = 0x04,
    CAN_CHANNEL5 = 0x05,
    CAN_CHANNEL6 = 0x06,
    CAN_CHANNEL7 = 0x07,
    CAN_CHANNEL8 = 0x08,
    CAN_CHANNEL9 = 0x09,
    CAN_CHANNEL10 = 0x0A,
    CAN_CHANNEL11 = 0x0B,
    CAN_CHANNEL12 = 0x0C,
    CAN_CHANNEL13 = 0x0D,
    CAN_CHANNEL14 = 0x0E,
    CAN_CHANNEL15 = 0x0F,
    CAN_CHANNEL16 = 0x10,
    CAN_CHANNEL17 = 0x11,
    CAN_CHANNEL18 = 0x12,
    CAN_CHANNEL19 = 0x13,
    CAN_CHANNEL20 = 0x14,
    CAN_CHANNEL21 = 0x15,
    CAN_CHANNEL22 = 0x16,
    CAN_CHANNEL23 = 0x17,
    CAN_CHANNEL24 = 0x18,
    CAN_CHANNEL25 = 0x19,
    CAN_CHANNEL26 = 0x1A,
    CAN_CHANNEL27 = 0x1B,
    CAN_CHANNEL28 = 0x1C,
    CAN_CHANNEL29 = 0x1D,
    CAN_CHANNEL30 = 0x1E,
    CAN_CHANNEL31 = 0x1F,
    CAN_TOTAL_CHANNELS = 0x20

} CAN_CHANNEL;

typedef enum {

    CAN_NORMAL_MODE = 0x00,
    CAN_DISABLE_MODE = 0x01,
    CAN_LOOPBACK_MODE = 0x02,
    CAN_LISTEN_ONLY_MODE = 0x03,
    CAN_CONFIGURATION_MODE = 0x04,
    CAN_LISTEN_ALL_MESSAGES_MODE = 0x07

} CAN_OPERATION_MODES;

typedef enum {

    CAN_RX_CHANNEL_NOT_EMPTY = 0x01,
    CAN_RX_CHANNEL_HALF_FULL = 0x02,
    CAN_RX_CHANNEL_FULL = 0x04,
    CAN_RX_CHANNEL_OVERFLOW = 0x08,
    CAN_RX_CHANNEL_ANY_EVENT = 0x0F,
    CAN_TX_CHANNEL_EMPTY = 0x100,
    CAN_TX_CHANNEL_HALF_EMPTY = 0x200,
    CAN_TX_CHANNEL_NOT_FULL = 0x400,
    CAN_TX_CHANNEL_ANY_EVENT = 0x700

} CAN_CHANNEL_EVENT;

typedef enum {

    CAN_BAUD_RATE_PRESCALE_1 = 0,
    CAN_BAUD_RATE_PRESCALE_2 = 1,
    CAN_BAUD_RATE_PRESCALE_3 = 2,
    CAN_BAUD_RATE_PRESCALE_4 = 3,
    CAN_BAUD_RATE_PRESCALE_5 = 4,
    CAN_BAUD_RATE_PRESCALE_6 = 5,
    CAN_BAUD_RATE_PRESCALE_7 = 6,
    CAN_BAUD_RATE_PRESCALE_8 = 7,
    CAN_BAUD_RATE_PRESCALE_9 = 8,
    CAN_BAUD_RATE_PRESCALE_10 = 9,
    CAN_BAUD_RATE_PRESCALE_11 = 10,
    CAN_BAUD_RATE_PRESCALE_12 = 11,
    CAN_BAUD_RATE_PRESCALE_13 = 12,
    CAN_BAUD_RATE_PRESCALE_14 = 13,
    CAN_BAUD_RATE_PRESCALE_15 = 14,
    CAN_BAUD_RATE_PRESCALE_16 = 15,
    CAN_BAUD_RATE_PRESCALE_17 = 16,
    CAN_BAUD_RATE_PRESCALE_18 = 17,
    CAN_BAUD_RATE_PRESCALE_19 = 18,
    CAN_BAUD_RATE_PRESCALE_20 = 19,
    CAN_BAUD_RATE_PRESCALE_21 = 20,
    CAN_BAUD_RATE_PRESCALE_22 = 21,
    CAN_BAUD_RATE_PRESCALE_23 = 22,
    CAN_BAUD_RATE_PRESCALE_24 = 23,
    CAN_BAUD_RATE_PRESCALE_25 = 24,
    CAN_BAUD_RATE_PRESCALE_26 = 25,
    CAN_BAUD_RATE_PRESCALE_27 = 26,
    CAN_BAUD_RATE_PRESCALE_28 = 27,
    CAN_BAUD_RATE_PRESCALE_29 = 28,
    CAN_BAUD_RATE_PRESCALE_30 = 29,
    CAN_BAUD_RATE_PRESCALE_31 = 30,
    CAN_BAUD_RATE_PRESCALE_32 = 31,
    CAN_BAUD_RATE_PRESCALE_33 = 32,
    CAN_BAUD_RATE_PRESCALE_34 = 33,
    CAN_BAUD_RATE_PRESCALE_35 = 34,
    CAN_BAUD_RATE_PRESCALE_36 = 35,
    CAN_BAUD_RATE_PRESCALE_37 = 36,
    CAN_BAUD_RATE_PRESCALE_38 = 37,
    CAN_BAUD_RATE_PRESCALE_39 = 38,
    CAN_BAUD_RATE_PRESCALE_40 = 39,
    CAN_BAUD_RATE_PRESCALE_41 = 40,
    CAN_BAUD_RATE_PRESCALE_42 = 41,
    CAN_BAUD_RATE_PRESCALE_43 = 42,
    CAN_BAUD_RATE_PRESCALE_44 = 43,
    CAN_BAUD_RATE_PRESCALE_45 = 44,
    CAN_BAUD_RATE_PRESCALE_46 = 45,
    CAN_BAUD_RATE_PRESCALE_47 = 46,
    CAN_BAUD_RATE_PRESCALE_48 = 47,
    CAN_BAUD_RATE_PRESCALE_49 = 48,
    CAN_BAUD_RATE_PRESCALE_50 = 49,
    CAN_BAUD_RATE_PRESCALE_51 = 50,
    CAN_BAUD_RATE_PRESCALE_52 = 51,
    CAN_BAUD_RATE_PRESCALE_53 = 52,
    CAN_BAUD_RATE_PRESCALE_54 = 53,
    CAN_BAUD_RATE_PRESCALE_55 = 54,
    CAN_BAUD_RATE_PRESCALE_56 = 55,
    CAN_BAUD_RATE_PRESCALE_57 = 56,
    CAN_BAUD_RATE_PRESCALE_58 = 57,
    CAN_BAUD_RATE_PRESCALE_59 = 58,
    CAN_BAUD_RATE_PRESCALE_60 = 59,
    CAN_BAUD_RATE_PRESCALE_61 = 60,
    CAN_BAUD_RATE_PRESCALE_62 = 61,
    CAN_BAUD_RATE_PRESCALE_63 = 62,
    CAN_BAUD_RATE_PRESCALE_64 = 63

} CAN_BAUD_RATE_PRESCALE;

typedef enum {

    CAN_TIME_SEGMENT_LEN_1TQ = 0x00,
    CAN_TIME_SEGMENT_LEN_2TQ = 0x01,
    CAN_TIME_SEGMENT_LEN_3TQ = 0x02,
    CAN_TIME_SEGMENT_LEN_4TQ = 0x03,
    CAN_TIME_SEGMENT_LEN_5TQ = 0x04,
    CAN_TIME_SEGMENT_LEN_6TQ = 0x05,
    CAN_TIME_SEGMENT_LEN_7TQ = 0x06,
    CAN_TIME_SEGMENT_LEN_8TQ = 0x07

} CAN_TIME_SEGMENT_LENGTH;

typedef enum {

    CAN_CHANNEL0_EVENT = 0x00,
    CAN_CHANNEL1_EVENT = 0x01,
    CAN_CHANNEL2_EVENT = 0x02,
    CAN_CHANNEL3_EVENT = 0x03,
    CAN_CHANNEL4_EVENT = 0x04,
    CAN_CHANNEL5_EVENT = 0x05,
    CAN_CHANNEL6_EVENT = 0x06,
    CAN_CHANNEL7_EVENT = 0x07,
    CAN_CHANNEL8_EVENT = 0x08,
    CAN_CHANNEL9_EVENT = 0x09,
    CAN_CHANNEL10_EVENT = 0x0A,
    CAN_CHANNEL11_EVENT = 0x0B,
    CAN_CHANNEL12_EVENT = 0x0C,
    CAN_CHANNEL13_EVENT = 0x0D,
    CAN_CHANNEL14_EVENT = 0x0E,
    CAN_CHANNEL15_EVENT = 0x0F,
    CAN_CHANNEL16_EVENT = 0x10,
    CAN_CHANNEL17_EVENT = 0x11,
    CAN_CHANNEL18_EVENT = 0x12,
    CAN_CHANNEL19_EVENT = 0x13,
    CAN_CHANNEL20_EVENT = 0x14,
    CAN_CHANNEL21_EVENT = 0x15,
    CAN_CHANNEL22_EVENT = 0x16,
    CAN_CHANNEL23_EVENT = 0x17,
    CAN_CHANNEL24_EVENT = 0x18,
    CAN_CHANNEL25_EVENT = 0x19,
    CAN_CHANNEL26_EVENT = 0x1A,
    CAN_CHANNEL27_EVENT = 0x1B,
    CAN_CHANNEL28_EVENT = 0x1C,
    CAN_CHANNEL29_EVENT = 0x1D,
    CAN_CHANNEL30_EVENT = 0x1E,
    CAN_CHANNEL31_EVENT = 0x1F,
    CAN_NO_EVENT = 0x40,
    CAN_ERROR_EVENT = 0x41,
    CAN_WAKEUP_EVENT = 0x42,
    CAN_RX_CHANNEL_OVERFLOW_EVENT = 0x43,
    CAN_ADDRESS_ERROR_EVENT = 0x44,
    CAN_BUS_BANDWIDTH_ERROR = 0x45,
    CAN_TIMESTAMP_TIMER_EVENT = 0x46,
    CAN_MODE_CHANGE_EVENT = 0x47,
    CAN_INVALID_MESSAGE_RECEIVED_EVENT = 0x48

} CAN_EVENT_CODE;

